package types_ex

import "fmt"

////////////////////////////////////////////////////////////
//                                                        //
//                                                        //
//      В Л О Ж Е Н Н Ы Е      С Т Р У К Т У Р Ы          //
//                                                        //
//                                                        //
////////////////////////////////////////////////////////////

// определяем свой тип срезов строк
type library []string

// прикрепляем к нему метод
//
// для вывода всех элементов из среза
func (l library) print() {

	for _, val := range l {
		fmt.Println(val)
	}
}

// //////////////////////////////////////////////////////////
//
// Вызовы (для просмотра работы кода)
func ExampleMethods() {
	var lib library = library{"Book1", "Book2", "Book3"}
	lib.print()
}
